ellak/docs/misc/sample_soap_req

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://parameters.services.gsisws/">
   <soapenv:Header>
	<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
		<wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="USRToken">
			<wsse:Username>usr</wsse:Username>
			<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">pwd</wsse:Password>
		</wsse:UsernameToken>
	</wsse:Security>
   </soapenv:Header>soapenv:Header>
   <soapenv:Body>
      <par:queryByTaxIdRequest>
         <par:regisrty>
            <par:taxId>Put a valid taxId here</par:taxId>
            <par:municipality>e</par:municipality>
            <par:postalAddress>e</par:postalAddress>
            <par:postalAddressNo>e</par:postalAddressNo>
            <par:zipCode>e</par:zipCode>
            <par:phone>e</par:phone>
            <par:startDate> 2013-10-28T21:32:52</par:startDate>
            <par:endDate> 2013-10-28T21:32:52</par:endDate>
            <par:enterpriseTitle>e</par:enterpriseTitle>
            <par:taxOfficeId>e</par:taxOfficeId>
            <par:taxOfficeDescr>e</par:taxOfficeDescr>
            <par:activationStatus>1</par:activationStatus>
           
         </par:regisrty>
      </par:queryByTaxIdRequest>
   </soapenv:Body>
</soapenv:Envelope>